# LAB 02 - Pandas Library
## #04. 데이터 확인하기

In [ ]:
# 반복문 처리 시에는 iloc[:]이 빠르긴 한데... 노가다성이 큼 (비추)

# DataFrame의 기본은 "열 -> 행"이 국룰임!!
# -> 그래서 표이름[A] 의 의미는: 표의 A열 이라는 거임!
# -> 표이름[A][B]: 이게 A행 -> B열의 특정 데이터를 뜻하는거임!
# (주의) 값 변경 시에는 행 -> 열 순으로 접근해야만 가능!!
# -> 기본접근이 열->행 이고 행->열 순 접근은 "표이름.loc[A, B]"
    # "표이름.loc[A, B]": A행 -> B열 !!

# 데이터프레임의 데이터타입:수치형, 범주형
# -> 수치형은 비교, 연산 가능하지만
    # max, min, std등 다 통계 가능
# -> 범주형 데이터는 연산불가! (ex. 학년도 범주형임)

# 포토폴리오에 그래프 잘 안들어가고 기술통계표(if EDA included)만 넣어주면 된다
# -> 기술통계표 아래에 분석을 서술해주면 된다

### 라이브러리 참조하기

In [2]:
from hossam import load_data

### 데이터 가져오기

In [17]:
# 가상의 과목별 점수 데이터 불러오기:
origin = load_data('GRADE')
origin

# (field랑 description은 데이터에 따라 표시 안될 수도 있음)

[data] https://data.hossam.kr/data/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

### 데이터 구조 확인 - (1) 데이터의 차원, 크기

In [10]:
# NumPy, Series랑 기능 동일함:
print("차원:", origin.ndim)
print("크기:", origin.shape)

차원: 2
크기: (9, 6)

### 데이터 구조 확인 - (2) 각 필드별 데이터타입, 정보

In [ ]:
# 필드별 데이터 타입:
origin.dtypes

학년     int64
성별    object
국어     int64
영어     int64
수학     int64
과학     int64
dtype: object

In [ ]:
# 필드별 정보:
origin.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: int64(5), object(1)
memory usage: 504.0+ bytes

### 데이터 내용 확인 - (1) df는 열 먼저 읽는게 국룰!

In [ ]:
# df 특정 "열"의 데이터 확인: ('origin[열이름]')
origin['국어']

이름
철수    98
영희    88
민철    92
수현    63
호영    75
영호    80
용식    82
나영    90
석영    91
Name: 국어, dtype: int64

In [19]:
# df 특정 "열"의 type 확인 -> Series:
type(origin['국어'])

pandas.core.series.Series

### 데이터 내용 확인 - (2) df이름[[열이름1, 열이름2, 열이름3,..]]

In [ ]:
# 원하는 열만 추출 시에는 대괄호가 '이중'으로 표기됨!:
df2 = origin[['국어', '영어', '수학']]
df2

    국어   영어  수학
이름
철수  98   77  88
영희  88  120  62
민철  92   70  83
수현  63   60  31
호영  75   50  90
영호  80   88  91
용식  82   88  79
나영  90   92  81
석영  91   90  89

### 특정 '행' 접근 - (1) 인덱스 '이름' 기반일 때 ('df이름.loc[행이름]')

In [ ]:
# 'df이름[열이름]' 사이에 '.loc'를 추가 (열이름 -> 행이름):
origin.loc['철수']

학년     1
성별    남자
국어    98
영어    77
수학    88
과학    64
Name: 철수, dtype: object

In [23]:
# 특정 '행'의 데이터 타입 확인: 
type(origin.loc['철수']) # Series 타입임을 확인 가능

# df는 열과 행이 모두 'Series 타입'으로 구성된 객체임!
# -> df의 열, 행 모두는 Series객체의 모든 메서드 사용가능!

pandas.core.series.Series

### 특정 '행' 접근 - (1) 인덱스 '번호' 기반일 때 ('df이름.iloc[행인덱스]')

In [24]:
# 'df이름[열이름]' 사이에 '.iloc'를 추가 (열이름 -> 행인덱스번호):
origin.iloc[0]

학년     1
성별    남자
국어    98
영어    77
수학    88
과학    64
Name: 철수, dtype: object

In [25]:
# 인덱스 번호로 접근할 경우 슬라이싱 가능!:
origin.iloc[1:4]

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71

### 단일값 확인하기 - (1) 괄호의 표현에 따른 열->행, 행->열 접근법

In [ ]:
# 이름 기반 열->행 순서 접근법: '프레임이름[열이름][행이름]'
origin['국어']['철수']

np.int64(98)

In [ ]:
# 이름 기반 행->열 순서 접근법: '프레임이름.loc[행이름, 열이름]'
origin.loc['철수', '국어']

np.int64(98)

### 단일값 확인하기 - (2) 인덱스번호 기반 데이터 접근

In [35]:
# 인덱스번호 사용 시 "행->열"로 접근이 고정됨!!!

# 1번째 행의 2번째 열 데이터
origin.iloc[1, 2]

np.int64(88)

In [36]:
# 인덱스 번호로 접근할 경우 슬라이싱 가능
origin.iloc[:, 3]   # 모든 행에서 3번째 열만 가져옴

이름
철수     77
영희    120
민철     70
수현     60
호영     50
영호     88
용식     88
나영     92
석영     90
Name: 영어, dtype: int64

### 값의 변경 - 행->열 접근에서만 가능 ('.loc[행이름][열이름]')

In [39]:
# 행->열 접근에서만 값 변경 가능:
origin.loc['철수', '국어'] = 100
origin

    학년  성별   국어   영어  수학  과학
이름
철수   1  남자  100   77  88  64
영희   2  여자   88  120  62  72
민철   1  남자   92   70  83  79
수현   3  여자   63   60  31  71
호영   4  남자   75   50  90  88
영호   4  남자   80   88  91  72
용식   2  남자   82   88  79  90
나영   1  여자   90   92  81  95
석영   1  남자   91   90  89  80

### 데이터 일부만 확인 - 목적: 데이터 형태 가늠 ('.head()', '.tail()')

In [44]:
# 상위 n건 확인법:
    # 파라미터가 생략 될 경우: 기본값 = 5
origin.head(2)
#origin.head()

    학년  성별   국어   영어  수학  과학
이름
철수   1  남자  100   77  88  64
영희   2  여자   88  120  62  72

In [46]:
# 하위 n건 확인법:
    # 파라미터가 생략 될 경우: 기본값 = 5
origin.tail(2)

# 실제 다룰 데이터프레임은 수십만 개의 행을 갖고 있을 수 있음
    # -> 한번에 출력 불가하니, 일부만 출력해서 데이터 형태를 가능해야 한다

    학년  성별  국어  영어  수학  과학
이름
나영   1  여자  90  92  81  95
석영   1  남자  91  90  89  80

### 기초통계량 확인 - (1) 컬럼 단위 확인

In [50]:
# DataFrame의 컬럼은 Series 객체이므로 기술통계량 메서드를 가지고 있다
print("합계:", origin['국어'].sum())
print("평균:", origin['국어'].mean())
print("최대:", origin['국어'].max())
print("최소:", origin['국어'].min())
print("분산:", origin['국어'].var())
print("표준편차:", origin['국어'].std())
print("중앙값:", origin['국어'].median())
print("1사분위 수:", origin['국어'].quantile(0.25))
print("2사분위 수:", origin['국어'].quantile(0.5))
print("3사분위 수:", origin['국어'].quantile(0.75))

합계: 761
평균: 84.55555555555556
최대: 100
최소: 63
분산: 120.02777777777779
표준편차: 10.955718953029864
중앙값: 88.0
1사분위 수: 80.0
2사분위 수: 88.0
3사분위 수: 91.0

### 기초통계량 확인 - (2) DataFrame 단위 확인

In [51]:
# 모든 컬럼에 대해서 일괄 계산한다.
    # 주의: 계산할 수 없는 형태의 값 (범주형 데이터)도 계산되니까 주의!
origin.sum()

학년                    19
성별    남자여자남자여자남자남자남자여자남자
국어                   761
영어                   735
수학                   694
과학                   711
dtype: object

### 기초통계량 확인 - (3) .describe() 함수로 기술 통계량 일괄 산출

In [ ]:
# 컬럼 단위로 모든 기술통계량 일괄 산출
origin['국어'].describe()

count      9.000000
mean      84.555556
std       10.955719
min       63.000000
25%       80.000000
50%       88.000000
75%       91.000000
max      100.000000
Name: 국어, dtype: float64

In [55]:
# DataFrame 단위로 모든 기술통계량 일괄 산출
    # 주의: 범주형데이터 열 제외하고 연산가능한 수치형데이터 열만 추출해야함!

# 연산가능 컬럼 추출:
df2 = origin[['국어', '영어', '수학', '과학']]
desc = df2.describe()
desc

               국어          영어         수학         과학
count    9.000000    9.000000   9.000000   9.000000
mean    84.555556   81.666667  77.111111  79.000000
std     10.955719   20.481699  19.451507  10.283482
min     63.000000   50.000000  31.000000  64.000000
25%     80.000000   70.000000  79.000000  72.000000
50%     88.000000   88.000000  83.000000  79.000000
75%     91.000000   90.000000  89.000000  88.000000
max    100.000000  120.000000  91.000000  95.000000

### 기초통계량 확인 - (4) 전치 구하기 ('.T')

In [ ]:
# 전치: 가로, 세로가 바뀐 표 
t = desc.T
t      # -> 데이터분석 실무 때 쓰이는 형식임

    count       mean        std   min   25%   50%   75%    max
국어    9.0  84.555556  10.955719  63.0  80.0  88.0  91.0  100.0
영어    9.0  81.666667  20.481699  50.0  70.0  88.0  90.0  120.0
수학    9.0  77.111111  19.451507  31.0  79.0  83.0  89.0   91.0
과학    9.0  79.000000  10.283482  64.0  72.0  79.0  88.0   95.0

### 기초통계량 확인 - (5) 빈도수 구하기 ('.value_counts()')

In [59]:
# 빈도수: 종류별 값의 수
    # 연산이 불가능한 범주형 데이터에서 
    # 종류별 수량을 구하고 데이터 분포를 확인할 때 쓰임
origin['성별'].value_counts()

성별
남자    6
여자    3
Name: count, dtype: int64

In [ ]:
# .value_counts() : 범주형 데이터의 종류별 카운트 구할 때 씀
origin['학년'].value_counts()

학년
1    4
2    2
4    2
3    1
Name: count, dtype: int64